{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_148","layers":[{"class_name":"Dense","config":{"units":32,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12","trainable":true,"batch_input_shape":[null,1],"dtype":"float32"}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense13","trainable":true}}]},"keras_version":"tfjs-layers 4.21.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.21.0","convertedBy":null,"weightsManifest":[{"paths":["./lr-model-2.weights.bin"],"weights":[{"name":"dense_Dense12/kernel","shape":[1,32],"dtype":"float32"},{"name":"dense_Dense12/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense13/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense13/bias","shape":[1],"dtype":"float32"}]}]}